roeetal/enph253/Software/STM32/brain/Src/main.c
        //     if (ewok_cnt == 4 || ewok_cnt == 5)
        //     {
        //         if (EDGE_LEFT_STATE == FLAGGED && EDGE_RIGHT_STATE == NOT_FLAGGED)
        //         {
        //             drive_straight_time(&enc_pid, 0, RIGHT_SPEED - 100, 400);
        //             uint32_t temp_time = HAL_GetTick();
        //             while ((HAL_GetTick() - temp_time) < 3000 && PI_INT_STATE == NOT_FLAGGED)
        //                 ;
        //         }
        //         else if (EDGE_LEFT_STATE == NOT_FLAGGED && EDGE_RIGHT_STATE == FLAGGED)
        //         {
        //             drive_straight_time(&enc_pid, LEFT_SPEED - 100, 0, 400);
        //             uint32_t temp_time = HAL_GetTick();
        //             while ((HAL_GetTick() - temp_time) < 3000 && PI_INT_STATE == NOT_FLAGGED)
        //                 ;
        //         }
        //     }
        //     drive_straight_time(&enc_pid, LEFT_SPEED - 100, RIGHT_SPEED - 100, 500);
        //     uint32_t temp_time = HAL_GetTick();
        //     while ((HAL_GetTick() - temp_time) < 3000 && PI_INT_STATE == NOT_FLAGGED)
        //         ;
        // }

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
    }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 72;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

void square_edge(PID_t *enc_pid)
{
    while (1)
    {
        char msg[18] = "";
        sprintf(msg, "EL: %d\n", EDGE_LEFT_STATE == FLAGGED ? 1 : 0);
        print(msg, 0);
        sprintf(msg, "ER: %d\n", EDGE_RIGHT_STATE == FLAGGED ? 1 : 0);
        print(msg, 0);
        print("\n", 0);
        drive_straight(enc_pid);
        if (EDGE_LEFT_STATE == FLAGGED || EDGE_RIGHT_STATE == FLAGGED)
        {
            
            if (EDGE_LEFT_STATE == FLAGGED)
            {
                set_motor_speed(TIM_CHANNEL_1, 0);
            }
            if (EDGE_RIGHT_STATE == FLAGGED)
            {
                set_motor_speed(TIM_CHANNEL_3, 0);
            }
        }
        else if (EDGE_LEFT_STATE == FLAGGED && EDGE_RIGHT_STATE == FLAGGED)
        {
            break;
        }
    }
}

void drive_straight_time(PID_t *enc_pid, uint32_t lspeed, uint32_t rspeed, uint32_t millis)
{
    set_motor_speed(TIM_CHANNEL_1, lspeed);
    set_motor_speed(TIM_CHANNEL_3, rspeed);
    uint32_t temp_time = HAL_GetTick();
    while ((HAL_GetTick() - temp_time) < millis)
    {
        drive_straight(enc_pid);
    }
    set_motor_speed(TIM_CHANNEL_1, 0);
    set_motor_speed(TIM_CHANNEL_3, 0);
}

void drive_straight(PID_t *enc_pid)
{
    encoder_pid(enc_pid);
    HAL_Delay(10);
}

/*
 * Assume motors are not on.
 * Reads adc, turns left or right based on voltage. Left max= 0 , no turn = 1.65 V, right max = 3.3V.
 */
void turn()
{
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));
    //TODO calculate time needed to fill first buffer
    HAL_Delay(100);
    float volts = calculate_heading(2 * adc_values[5]);
    uint16_t counts = TURN_CONST * fabs(volts);
    TIM4->CNT = 0;
    TIM5->CNT = 0;

    char msg[18] = "";
    sprintf(msg, "cnts: %d\n", counts);
    print(msg, 0);
    int pre_dec = (int)(volts / 1);
    int post_dec = (int)((volts - pre_dec) * 1000);
    sprintf(msg, "vlts: %d.%d\n", pre_dec, post_dec);
    print(msg, 2);

    if (volts < -TURN_TOLERANCE)
    {
        set_motor_speed(TIM_CHANNEL_1, 0);
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        while (TIM5->CNT < counts)
        {
            // sprintf(msg, "TIM5->CNT: %lu\n", TIM5->CNT);
            // print(msg, 4);
        }
        sprintf(msg, "TIM5->CNT: %lu\n", TIM5->CNT);
        print(msg, 4);
        TIM5->CNT = 0;
    }
    else if (volts > TURN_TOLERANCE)
    {
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        set_motor_speed(TIM_CHANNEL_3, 0);
        while (TIM4->CNT < counts)
        {
            // sprintf(msg, "TIM4->CNT: %lu\n", TIM4->CNT);
            // print(msg, 4);
        }
        sprintf(msg, "TIM4->CNT: %lu\n", TIM4->CNT);
        print(msg, 4);
        TIM4->CNT = 0;
    }
    set_motor_speed(TIM_CHANNEL_1, 0);
    set_motor_speed(TIM_CHANNEL_3, 0);
    HAL_ADC_Stop_DMA(&hadc1);
}

