roeetal/enph253/Software/STM32/brain/Src/main.c
/*
 * Assume motors are not on.
 * Reads adc, turns left or right based on voltage. Left max= 0 , no turn = 1.65 V, right max = 3.3V.
 */
void turn_deg(uint8_t deg)
{
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));
    uint16_t counts = 50.0 / 90.0 * (deg - 90) + 50;
    TIM4->CNT = 0;
    TIM5->CNT = 0;

    char msg[18] = "";

    if (deg > 0) // FIXME: Ben changed this
    {
        set_motor_speed(TIM_CHANNEL_1, 0);
        set_motor_speed(TIM_CHANNEL_3, LEFT_SPEED);
        while (TIM5->CNT < counts)
        {
            sprintf(msg, "TIM5->CNT: %lu\n", TIM5->CNT);
            print(msg, 4);
        }
        sprintf(msg, "TIM5->CNT: %lu\n", TIM5->CNT);
        print(msg, 4);
        TIM5->CNT = 0;
    }
    else if (deg < 0) // FIXME: Ben changed this
    {
        set_motor_speed(TIM_CHANNEL_1, RIGHT_SPEED);
        set_motor_speed(TIM_CHANNEL_3, 0);
        while (TIM4->CNT < counts)
        {
            sprintf(msg, "TIM4->CNT: %lu\n", TIM4->CNT);
            print(msg, 4);
        }
        sprintf(msg, "TIM4->CNT: %lu\n", TIM4->CNT);
        print(msg, 4);
        TIM4->CNT = 0;
    }
    set_motor_speed(TIM_CHANNEL_1, 0);
    set_motor_speed(TIM_CHANNEL_3, 0);
    HAL_ADC_Stop_DMA(&hadc1);
}

/**
 * Resistor ladder: 8-bit, 0->3.3v.
 * ADC: 12-bit, 0->3.3V
 *
 * @param adc_val, value read from ADC.
 * @return heading as a percentage from -50 (left) to 50 (right).
 **/
float calculate_heading(uint32_t adc_val)
{
    return adc_val / 4096.0 - 0.5;
}

// Sampling frequency: 72e6/2/(495*3)
void alarm_detect()
{
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));
    //TODO calculate time needed to fill first buffer
    HAL_Delay(500);
    while (goertzel(adc_values, 24242, 1000, sizeof(dma_buffer) / sizeof(dma_buffer[0]), 0) < 100)
        ;
    while (goertzel(adc_values, 24242, 1000, sizeof(dma_buffer) / sizeof(dma_buffer[0]), 0) > 100)
        ;
    HAL_ADC_Stop_DMA(&hadc1);
    IR_INT_STATE = NOT_FLAGGED;
}

/**
 * @brief prints string to row, rows from 0 - 6, resets screen when printing from row 0
 * @param msg, string to print
 * @param row, row to print msg to
 */
void print(char *msg, int row)
{
    // if (row == 0)
    // {
    //     ssd1306_Fill(Black);
    // }
    // ssd1306_SetCursor(0, row * 10);
    // ssd1306_WriteString(msg, Font_7x10, White);
    // ssd1306_UpdateScreen();
    HAL_UART_Transmit(&huart6, (uint8_t *) msg, strlen(msg), 100);
}

PID_t menu()
{
    print("Starting\n", 0);
    char msg[20] = "";
    int pid_select = 0;
    uint32_t values[2] = {0, 0};
    while (1)
    {
        if (HAL_GPIO_ReadPin(MENU_GPIO_Port, MENU_Pin) == 0)
        {
            sprintf(msg, "%lu\n", values[pid_select]);
            print(msg, 0);
            while (HAL_GPIO_ReadPin(MENU_GPIO_Port, MENU_Pin) == 0)
            {
                values[pid_select]++;
                sprintf(msg, "%lu\n", values[pid_select]);
                print(msg, 0);
                HAL_Delay(500);
            }
            ++pid_select;
        }
        if (pid_select == 2)
            break;
    }
    return pid_Init(values[0], values[1], 1, 1, 1);
}

void set_motor_speed(uint32_t channel, uint32_t speed)
{
    if (channel == TIM_CHANNEL_1)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 0);
    }
    else if (channel == TIM_CHANNEL_2)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0);
    }
    else if (channel == TIM_CHANNEL_3)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 0);
    }
    else if (channel == TIM_CHANNEL_4)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0);
    }
    __HAL_TIM_SET_COMPARE(&htim1, channel, speed > 1000 ? 1000 : speed);
}

void encoder_pid(PID_t *enc_pid)
{
    /* Get error */
    uint32_t lcnt = TIM4->CNT;
    uint32_t rcnt = TIM5->CNT;
    enc_pid->err = lcnt - rcnt;

    /* Get gain */
    // Gain <0 for ride side faster
    int gain = pid_GetGain(enc_pid);

    /* Set Motor Speeds*/
    uint32_t lspeed = LEFT_SPEED;
    uint32_t rspeed = RIGHT_SPEED;
    if (gain < 0)
    {
        lspeed -= gain;
    }
    else if (gain > 0)
    {
        rspeed += gain;
    }

    // char msg[18] = "";
    // sprintf(msg, "LS: %lu", lspeed);
    // print(msg, 0);
    // sprintf(msg, "RS: %lu", rspeed);
    // print(msg, 1);
    // set_motor_speed(TIM_CHANNEL_1, lspeed);
    // set_motor_speed(TIM_CHANNEL_3, rspeed);

    /* Prevent weird overflow shit */
    if (lcnt > 60000 || rcnt > 60000)
    {
        TIM4->CNT -= 50000;
        TIM5->CNT -= 50000;
    }
}

// ******
// TESTS
// ******

/*
 * Instructions:
 *      Run test_All() before the main while loop
 *      - Put a pull up resistor on htim3 PWM waves, measure voltage on pin
 *      - Measure voltage on pin of htim1
 *      - Give ADC pins values and read off of screen
 */

/*
 * Test PWM
 * Output: htim1 channel 1 through 4, PWM wave. Confirm these
 *         PWM waves via an oscilliscope.
 */
void test_PWM_htim1()
{
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    // HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
    // HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
    int s = 0;
    while (s < 1000)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, s);
        // __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 500);
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, s);
        // __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 500);
        s += 100;
        HAL_Delay(1000);
    }
}

/*
 * Test PWM
 * Output: htim3 channel 1 through 3, PWM wave. Confirm these
 *         PWM waves via an oscilliscope.
 */
void test_PWM_htim3()
{
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);

    int s = 500;
    while (s < 2400)
    {
        __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, s);
        __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, s);
        __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, s);
        s += 100;
        HAL_Delay(500);
    }
}

