roeetal/enph253/Software/STM32/brain/Src/main.c
void test_ADC()
{
    char msg[18] = "";
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));

    while (1)
    {
        int ch_5 = adc_values[0];
        int ch_4 = adc_values[1];

        sprintf(msg, "ch_5: %d\n", ch_5);
        print(msg, 0);

        sprintf(msg, "ch_4: %d\n", ch_4);
        print(msg, 2);

        HAL_Delay(100);
    }
}

/**
 * Test all PWM and ADC - Read PWM waves, input ADC voltages 
 * and read values on OLED
 *      htim1 -> CH1, CH2, CH3, CH4
 *      htim3 -> CH1, CH2, CH3
 *      ADC   -> CH5, CH4
 */
void test_All()
{
    test_PWM_htim1();
    test_PWM_htim3();
    test_ADC();
}
// ******
// END TESTS
// ******

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */
    while (1)
    {
    }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
